nxp-mcuxpresso/mcux-soc-svd/MCXN946/MCXN946_cm33_core0.xml
        <register>
          <name>FLEXIO_TRIG3</name>
          <description>FlexIO Trigger Input Connections</description>
          <addressOffset>0x6EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number for FlexIO0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>PINT PIN_INT4 input is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>PINT PIN_INT5 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>PINT PIN_INT6 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>PINT PIN_INT7 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>SCT_OUT5 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>SCT_OUT6 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>SCT_OUT7 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>SCT_OUT8 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>SCT_OUT9 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>T0_MAT1 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>T1_MAT1 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>T2_MAT1 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>T3_MAT1 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>T4_MAT1 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>LPTMR0 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>LPTMR1 input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>PINT GPIO_INT_BMAT input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>ADC0_tcomp[0] input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>ADC0_tcomp[1] input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>ADC0_tcomp[2] input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>ADC0_tcomp[3] input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>ADC1_tcomp[0] input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>ADC1_tcomp[1] input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>ADC1_tcomp[2] input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>ADC1_tcomp[3] input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>CMP1_OUT input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>CMP2_OUT input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>PWM0_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>PWM0_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>PWM0_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>PWM0_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>PWM0_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>PWM0_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>PWM0_SM3_MUX_TRIG0 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>PWM0_SM3_MUX_TRIG1 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>PWM1_SM0_MUX_TRIG0 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>PWM1_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>PWM1_SM1_MUX_TRIG0 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>PWM1_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>PWM1_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>PWM1_SM3_MUX_TRIG0 input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>PWM1_SM3_MUX_TRIG1 input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>EVTG_OUT0A input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>EVTG_OUT0B input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>EVTG_OUT1A input is selected</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>EVTG_OUT1B input is selected</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>EVTG_OUT2A input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>EVTG_OUT2B input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>EVTG_OUT3A input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>EVTG_OUT3B input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>SINC Filter CH0 Conversion Complete input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>SINC Filter CH1 Conversion Complete input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>SINC Filter CH2 Conversion Complete input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>SINC Filter CH3 Conversion Complete input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>SINC Filter CH4 Conversion Complete input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>LP_FLEXCOMM0 trig 0 (lpuart_trg_txword) input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>LP_FLEXCOMM0 trig 1 (lpuart_trg_rxword) input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>LP_FLEXCOMM0 trig 2 (lpuart_trg_rxidle) input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>LP_FLEXCOMM1 trig 0 input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>LP_FLEXCOMM1 trig 1 input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>LP_FLEXCOMM1 trig 2 input is selected</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>LP_FLEXCOMM2 trig 0 input is selected</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val70</name>
                  <description>LP_FLEXCOMM2 trig 1 input is selected</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val71</name>
                  <description>LP_FLEXCOMM2 trig 2 input is selected</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val72</name>
                  <description>LP_FLEXCOMM3 trig 0 input is selected</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val73</name>
                  <description>LP_FLEXCOMM3 trig 1 input is selected</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val74</name>
                  <description>LP_FLEXCOMM3 trig 2 input is selected</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val75</name>
                  <description>LP_FLEXCOMM3 trig 3 input is selected</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val76</name>
                  <description>WUU input is selected</description>
                  <value>0x4C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
